# Используем базовый образ для Go
FROM golang:latest

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем исходный код в контейнер
COPY . .

# Устанавливаем зависимости и собираем Go-приложение
RUN go mod tidy && go build -o myapp .

# Создаем директорию для статичных файлов (если они есть)
RUN mkdir -p /app/static

# Копируем локальные изображения в папку "static" внутри контейнера
COPY static/ /app/static/

# Открываем порт 8080 для доступа к приложению
EXPOSE 8080

# Запускаем приложение
CMD ["./myapp"]

